Tekla.Structures.Model.ConnectiveGeometry
A class for geometry formed of several geometry sections. Geometry is initialized with polygon geometry
and then can be extended by calling one of AddLeg methods using BentPlateGeometrySolver class.
In the case of success, two polygon geometries will be connected by cylindrical surface geometry possibly
with help of additional polygon geometries.
Resulted geometry, then, can be set to bent plate.
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
public class Example
{
var contour1 = new Contour();
contour1.AddContourPoint(new ContourPoint(new Point(6000.0, 8500.0, 0.0), null));
contour1.AddContourPoint(new ContourPoint(new Point(6000.0, 6000.0, 0.0), null));
contour1.AddContourPoint(new ContourPoint(new Point(12000.0, 6000.0, 0.0), null));
contour1.AddContourPoint(new ContourPoint(new Point(12000.0, 8500.0, 0.0), null));
var geometry = new ConnectiveGeometry(contour1);
var contour2 = new Contour();
contour2.AddContourPoint(new ContourPoint(new Point(15000.0, 8500.0, 1000.0), null));
contour2.AddContourPoint(new ContourPoint(new Point(15000.0, 6000.0, 1000.0), null));
contour2.AddContourPoint(new ContourPoint(new Point(19600.0, 6000.0, 3500.0), null));
contour2.AddContourPoint(new ContourPoint(new Point(19600.0, 8500.0, 3500.0), null));
var radius = 2000.0;
var bentPlateGeometrySolver = new BentPlateGeometrySolver();
var newGeometry = bentPlateGeometrySolver.AddLeg(geometry, contour2, radius);
}

Tekla.Structures.Model.ConnectiveGeometry.InvalidGeometrySectionIndex
An invalid geometry section index.

Tekla.Structures.Model.ConnectiveGeometry.#ctor(Tekla.Structures.Model.Contour)
Initializes a new instance of the ConnectiveGeometry class.
contour: The polygon geometry

Tekla.Structures.Model.ConnectiveGeometry.#ctor(Tekla.Structures.Model.BendSurface)
Initializes a new instance of the ConnectiveGeometry class for a stand-alone bend creation.
bendSurface: Conical or cylindrical surface geometry.

Tekla.Structures.Model.ConnectiveGeometry.#ctor(Tekla.Structures.ModelInternal.GeometryTree)
Initializes a new instance of the ConnectiveGeometry class.
geometry: the initial geometry

Tekla.Structures.Model.ConnectiveGeometry.InternalGeometry
Gets or sets the internal geometry.

Tekla.Structures.Model.ConnectiveGeometry.IsEmpty
Checks whether the geometry is degenerate
Returns: True, if the geometry does not contain any section.

Tekla.Structures.Model.ConnectiveGeometry.GetGeometryEnumerator
Gets a new geometry sections enumerator for enumerating through the geometry sections.
Returns: The new geometry sections enumerator.

Tekla.Structures.Model.ConnectiveGeometry.GetNeighborSections(Tekla.Structures.Model.GeometrySection)
Gets neighbor sections of the geometrySection inside this ConnectiveGeometry.
geometrySection: GeometrySection to get neighbors for.
Returns: List of neighbor GeometrySection of the given GeometrySection.

Tekla.Structures.Model.ConnectiveGeometry.GetGeometryLegSections
Gets geometry end GeometrySections which are possible to remove.
Returns: Returns List of the removable GeometrySections.

Tekla.Structures.Model.ConnectiveGeometry.GetConnection(Tekla.Structures.Model.GeometrySection,Tekla.Structures.Model.GeometrySection)
Returns 2 connecting line segments between geometrySection1 and geometrySection2 sections, if sections are connected, otherwise returns empty list.
geometrySection1: The first GeometrySection.
geometrySection2: The second GeometrySection.
Returns: 2 connecting line segments if sections are connected, otherwise returns empty list.